#coding:gbk
# 子函数能够调用父函数的局部变量，父函数无法调用子函数的局部变量
# 以及多层嵌套中，局部变量访问问题示例：

def movie1():
    x1 = '彭于晏'
    print('movie1 中，x1是%s' % x1)

    def movie2():
        x1 = '沈腾'
        x2 = '韩寒'
        print('movie2中 x1 是%s，x2是%s',(x1, x2))

        def movie3():
            x3 = '林允儿'
            print('movie3中 x1 是%s，x2是%s， x3 是%s',(x1, x2, x3))

        return movie3()
    movie2()

movie1()

#==============================================================
#movie1 中，x1是彭于晏
#movie2中 x1 是%s，x2是%s ('沈腾', '韩寒')
#movie3中 x1 是%s，x2是%s， x3 是%s ('沈腾', '韩寒', '林允儿')
#==============================================================